aws/amazon-freertos/vendors/nordic/nRF5_SDK_15.2.0/components/nfc/t4t_lib/hal_t4t/hal_nfc_t4t.c
            m_t4t_active = false;

            /* Go back to default frame delay mode, bugfix for tag locking. */
            NRF_NFCT->FRAMEDELAYMODE = NFCT_FRAMEDELAYMODE_FRAMEDELAYMODE_WindowGrid <<
                                       NFCT_FRAMEDELAYMODE_FRAMEDELAYMODE_Pos;

            HAL_NFC_DEBUG_PIN_CLEAR(HAL_NFC_HCLOCK_OFF_DEBUG_PIN); // DEBUG!
            break;

        default:
            /* No implementation required */
            break;
    }
}
#endif // HAL_NFC_ENGINEERING_BC_FTPAN_WORKAROUND


/** @brief Writes default values to m_nfcid1_data based on NRF_FICR->NFC registers.
 */
static void hal_nfc_nfcid1_default_bytes(void)
{
    uint32_t nfc_tag_header0 = NRF_FICR->NFC.TAGHEADER0;
    uint32_t nfc_tag_header1 = NRF_FICR->NFC.TAGHEADER1;
    uint32_t nfc_tag_header2 = NRF_FICR->NFC.TAGHEADER2;

    m_nfcid1_data[0] = (uint8_t) LSB_32(nfc_tag_header0 >> 0);
    m_nfcid1_data[1] = (uint8_t) LSB_32(nfc_tag_header0 >> 8);
    m_nfcid1_data[2] = (uint8_t) LSB_32(nfc_tag_header0 >> 16);
    m_nfcid1_data[3] = (uint8_t) LSB_32(nfc_tag_header1 >> 0);
    m_nfcid1_data[4] = (uint8_t) LSB_32(nfc_tag_header1 >> 8);
    m_nfcid1_data[5] = (uint8_t) LSB_32(nfc_tag_header1 >> 16);
    m_nfcid1_data[6] = (uint8_t) LSB_32(nfc_tag_header1 >> 24);
    m_nfcid1_data[7] = (uint8_t) LSB_32(nfc_tag_header2 >> 0);
    m_nfcid1_data[8] = (uint8_t) LSB_32(nfc_tag_header2 >> 8);
    m_nfcid1_data[9] = (uint8_t) LSB_32(nfc_tag_header2 >> 16);

    /* Begin: Bugfix for FTPAN-181. */
    if (m_nfcid1_data[3] == 0x88)
    {
        m_nfcid1_data[3] |= 0x11;
    }
    /* End: Bugfix for FTPAN-181 */
}


/** @brief Resets NFCT peripheral to its default state before automatic collision resolution
 *         procedure.
 */
static inline void nrf_nfct_default_state_reset(void)
{
#if defined(NRF52832_XXAA) || defined(NRF52832_XXAB)
    if (((*(uint32_t volatile *)(0x40005420)) & 0x1UL) == (1UL))
#else
    if (NRF_NFCT->SLEEPSTATE & NFCT_SLEEPSTATE_SLEEPSTATE_Msk) // Default state is SLEEP_A
#endif //defined(NRF52832_XXAA) || defined(NRF52832_XXAB)
    {
        NRF_NFCT->TASKS_GOSLEEP = 1;
    }
    else // Default state is IDLE
    {
        NRF_NFCT->TASKS_GOIDLE = 1;
    }

    /* Disable RX here (will be enabled at SELECTED) */
    NRF_NFCT->INTENCLR = NFCT_INTENCLR_RXFRAMEEND_Clear <<
                         NFCT_INTENCLR_RXFRAMEEND_Pos;
}


ret_code_t hal_nfc_parameter_set(hal_nfc_param_id_t id, void * p_data, size_t data_length)
{
    /* Parameter validation is done in upper-layer */

    if (id == HAL_NFC_PARAM_FWI)
    {
        /* Update Frame Wait Time setting; possible settings are limited by NFCT hardware */
        m_fwi = *((uint8_t *)p_data);

        if (data_length != sizeof(uint8_t))
        {
            return NRF_ERROR_DATA_SIZE;
        }
        /* Frame Wait Time settings for first sample of 52840 */
        if (type_52840_sample_check())
        {
            if (m_fwi > NFC_T4T_FWI_52840S_MAX)
            {
                return NRF_ERROR_INVALID_PARAM;
            }
            /* Set FRAMEDELAYTIME */
            if (m_fwi == NFC_T4T_FWI_52840S_MAX)
            {
                NRF_NFCT->FRAMEDELAYMAX = NFCT_FRAMEDELAYMAX_52840S;
            }
            else
            {
                NRF_NFCT->FRAMEDELAYMAX = NFC_T4T_FWI_TO_FWT(m_fwi);
            }
        }
        else
        {
            if (m_fwi > NFC_T4T_FWI_MAX)
            {
                return NRF_ERROR_INVALID_PARAM;
            }

            /* Set FRAMEDELAYTIME */
            if (m_fwi == NFC_T4T_FWI_MAX)
            {
                NRF_NFCT->FRAMEDELAYMAX = NFCT_FRAMEDELAYMAX_FRAMEDELAYMAX_Msk;
            }
            else
            {
                NRF_NFCT->FRAMEDELAYMAX = NFC_T4T_FWI_TO_FWT(m_fwi);
            }
        }
    }
    else if (id == HAL_NFC_PARAM_SELRES)
    {
        /* Update SEL_RES 'Protocol' bits setting */
        uint8_t sel_res = *((uint8_t *)p_data);

        if (data_length != sizeof(uint8_t))
        {
            return NRF_ERROR_DATA_SIZE;
        }
        if (sel_res > NFC_T4T_SELRES_PROTOCOL_MSK)
        {
            return NRF_ERROR_INVALID_PARAM;
        }

        m_t4t_selres     = sel_res;
        NRF_NFCT->SELRES =
            (m_t4t_selres << NFCT_SELRES_PROTOCOL_Pos) & NFCT_SELRES_PROTOCOL_Msk;
    }
    else if (id == HAL_NFC_PARAM_NFCID1)
    {
        if (data_length == 1)
        {
            uint8_t id_length = *((uint8_t *) p_data);
            if (id_length == NFCID1_SINGLE_SIZE || id_length == NFCID1_DOUBLE_SIZE ||
                id_length == NFCID1_TRIPLE_SIZE)
            {
                m_nfcid1_length = id_length;
                hal_nfc_nfcid1_default_bytes();
            }
            else
            {
                return NRF_ERROR_INVALID_LENGTH;
            }
        }
        else if (data_length == NFCID1_SINGLE_SIZE || data_length == NFCID1_DOUBLE_SIZE ||
            data_length == NFCID1_TRIPLE_SIZE)
        {
            m_nfcid1_length = (uint8_t) data_length;
            memcpy(m_nfcid1_data, p_data, data_length);
        }
        else
        {
            return NRF_ERROR_INVALID_LENGTH;
        }
        hal_nfc_nfcid1_registers_setup();
    }
    else
    {
        /* No implementation needed */
    }

    return NRF_SUCCESS;
}

/* This function is used by nfc_lib for unit testing only */
ret_code_t hal_nfc_parameter_get(hal_nfc_param_id_t id, void * p_data, size_t * p_max_data_length)
{
    if (*p_max_data_length < 1)
    {
        *p_max_data_length = 1;
        return NRF_ERROR_DATA_SIZE;
    }

    if (id == HAL_NFC_PARAM_FWI)
    {
        *((uint8_t *) p_data) = m_fwi;
        *p_max_data_length    = sizeof(m_fwi);
    }
    else if (id == HAL_NFC_PARAM_SELRES)
    {
        /* Get SEL_RES 'Protocol' bits setting */
        *((uint8_t *) p_data) = m_t4t_selres;
        *p_max_data_length    = sizeof(m_t4t_selres);
    }
    else if (id == HAL_NFC_PARAM_NFCID1)
    {
        if (m_nfcid1_length == 0)
        {
            m_nfcid1_length = NFCID1_DEFAULT_LENGHT;
            hal_nfc_nfcid1_default_bytes();
        }

        if (*p_max_data_length < (size_t) m_nfcid1_length)
        {
            return NRF_ERROR_DATA_SIZE;
        }

