aws/amazon-freertos/vendors/nordic/nRF5_SDK_15.2.0/components/nfc/t4t_lib/hal_t4t/hal_nfc_t4t.c
        *p_max_data_length = (size_t) m_nfcid1_length;
        memcpy(p_data, m_nfcid1_data, m_nfcid1_length);
    }
    else
    {
        /* No implementation needed */
    }

    return NRF_SUCCESS;
}


ret_code_t hal_nfc_start(void)
{
    NRF_NFCT->ERRORSTATUS = NRF_NFCT_ERRORSTATUS_ALL;
    NRF_NFCT->TASKS_SENSE = 1;

    NVIC_ClearPendingIRQ(NFCT_IRQn);
    NVIC_SetPriority(NFCT_IRQn, NFCT_CONFIG_IRQ_PRIORITY);
    NVIC_EnableIRQ(NFCT_IRQn);

    NRF_LOG_INFO("Start");
    return NRF_SUCCESS;
}


ret_code_t hal_nfc_send(const uint8_t * p_data, size_t data_length, bool delayed_mode)
{
    if (data_length == 0)
    {
        return NRF_ERROR_DATA_SIZE;
    }

    /* Ignore previous TX END events, SW takes care only for data frames which tranmission is triggered in this function */
    nrf_nfct_event_clear(&NRF_NFCT->EVENTS_TXFRAMEEND);

    NRF_NFCT->INTENSET       = (NFCT_INTENSET_TXFRAMEEND_Enabled << NFCT_INTENSET_TXFRAMEEND_Pos); //Moved to the end in T4T to avoid delaying TASKS_STARTX
    NRF_NFCT->PACKETPTR      = (uint32_t) p_data;
    NRF_NFCT->TXD.AMOUNT     = (data_length << NFCT_TXD_AMOUNT_TXDATABYTES_Pos) &
                                NFCT_TXD_AMOUNT_TXDATABYTES_Msk;

    if (delayed_mode)
    {
        NRF_NFCT->FRAMEDELAYMODE = NFCT_FRAMEDELAYMODE_FRAMEDELAYMODE_ExactVal << 
                                   NFCT_FRAMEDELAYMODE_FRAMEDELAYMODE_Pos;
    }
    else
    {
        NRF_NFCT->FRAMEDELAYMODE = NFCT_FRAMEDELAYMODE_FRAMEDELAYMODE_WindowGrid << 
                                   NFCT_FRAMEDELAYMODE_FRAMEDELAYMODE_Pos;
        NRF_LOG_INFO("Send");
    }
    NRF_NFCT->TASKS_STARTTX  = 1;

    return NRF_SUCCESS;
}


ret_code_t hal_nfc_stop(void)
{
    NRF_NFCT->TASKS_DISABLE = 1;

    NRF_LOG_INFO("Stop");
    return NRF_SUCCESS;
}


ret_code_t hal_nfc_done(void)
{
    m_nfc_lib_callback = (hal_nfc_callback_t) NULL;

    return NRF_SUCCESS;
}


void NFCT_IRQHandler(void)
{
    nfct_field_sense_state_t current_field = NFC_FIELD_STATE_NONE;

    HAL_NFC_DEBUG_PIN_SET(HAL_NFC_NFC_EVENT_DEBUG_PIN); // DEBUG!

    if (NRF_NFCT->EVENTS_FIELDDETECTED && (NRF_NFCT->INTEN & NFCT_INTEN_FIELDDETECTED_Msk))
    {
        nrf_nfct_event_clear(&NRF_NFCT->EVENTS_FIELDDETECTED);
        HAL_NFC_DEBUG_PIN_SET(HAL_NFC_DETECT_EVENT_DEBUG_PIN); // DEBUG!
        current_field = NFC_FIELD_STATE_ON;
        HAL_NFC_DEBUG_PIN_CLEAR(HAL_NFC_DETECT_EVENT_DEBUG_PIN); // DEBUG!

        NRF_LOG_DEBUG("Field detected");
    }

#ifndef HAL_NFC_ENGINEERING_BC_FTPAN_WORKAROUND
    if (NRF_NFCT->EVENTS_FIELDLOST && (NRF_NFCT->INTEN & NFCT_INTEN_FIELDLOST_Msk))
    {
        nrf_nfct_event_clear(&NRF_NFCT->EVENTS_FIELDLOST);
        current_field =
           (current_field == NFC_FIELD_STATE_NONE) ? NFC_FIELD_STATE_OFF : NFC_FIELD_STATE_UNKNOWN;

        NRF_LOG_DEBUG("Field lost");
    }
#endif // HAL_NFC_ENGINEERING_BC_FTPAN_WORKAROUND

    /* Perform actions if any FIELD event is active */
    if (current_field != NFC_FIELD_STATE_NONE)
    {
        nrf_nfct_field_event_handler(current_field);
    }

    if (NRF_NFCT->EVENTS_RXFRAMEEND && (NRF_NFCT->INTEN & NFCT_INTEN_RXFRAMEEND_Msk))
    {
        /* Take into account only number of whole bytes */
        uint32_t rx_status    = 0;
        uint32_t rx_data_size = ((NRF_NFCT->RXD.AMOUNT & NFCT_RXD_AMOUNT_RXDATABYTES_Msk) >>
                                 NFCT_RXD_AMOUNT_RXDATABYTES_Pos) - NFC_CRC_SIZE;
        nrf_nfct_event_clear(&NRF_NFCT->EVENTS_RXFRAMEEND);

        if (NRF_NFCT->EVENTS_RXERROR && (NRF_NFCT->INTEN & NFCT_INTEN_RXERROR_Msk))
        {
            rx_status = (NRF_NFCT->FRAMESTATUS.RX & NRF_NFCT_FRAMESTATUS_RX_MSK);
            nrf_nfct_event_clear(&NRF_NFCT->EVENTS_RXERROR);

            NRF_LOG_DEBUG("Rx error (0x%x)", (unsigned int) rx_status);

            /* Clear rx frame status */
            NRF_NFCT->FRAMESTATUS.RX = NRF_NFCT_FRAMESTATUS_RX_MSK;
        }

        /* Ignore all NFC-A data frames with Transmission Error */
        if (rx_status)
        {
            /* Go back to idle state if currently in the ACTIVE_A state */
            if (!m_t4t_active)
            {
                nrf_nfct_default_state_reset();
            }
            /* Stay in the CARD_EMULATOR_4A state */
            else
            {
                /* Command with Transmission Error, so wait for next frame reception */
                NRF_NFCT->TASKS_ENABLERXDATA = 1;
            }
        }
        else
        {
            /* Look for NFC-A Commands */
            if (!m_t4t_active)
            {
                // 'NFC Forum Digital Protocol Technical Specification 2.0, 14.6.1.13' */
                if ((m_nfc_rx_buffer[0] == NFC_T4T_RATS_CMD) &&
                    ((m_nfc_rx_buffer[1] & NFC_T4T_RATS_DID_MASK) != NFC_T4T_RATS_DID_RFU))
                {
                    /* Disable Auto Collision Resolution */
#if defined(NRF52832_XXAA) || defined(NRF52832_XXAB)
                    (*(uint32_t volatile *)(0x4000559C)) |= (1u);
#else
                    NRF_NFCT->AUTOCOLRESCONFIG |= NFCT_AUTOCOLRESCONFIG_MODE_Msk;
#endif //defined(NRF52832_XXAA) || defined(NRF52832_XXAB)
                    m_t4t_active = true;
                    NRF_LOG_DEBUG("RX: T4T Activate");
                }
                /* Indicate that SLP_REQ was received - this will cause FRAMEDELAYTIMEOUT error */
                else if (m_nfc_rx_buffer[0] == NFC_SLP_REQ_CMD)
                {
                    // disable RX here (will enable at SELECTED)
                    m_slp_req_received = true;
                    NRF_NFCT->INTENCLR = NFCT_INTENCLR_RXFRAMEEND_Clear << NFCT_INTENCLR_RXFRAMEEND_Pos;
                }
                else
                {
                    nrf_nfct_default_state_reset();
                }
            }
            /* Look for Tag 4 Type Commands */
            else
            {
                /* Assume that the ISO-DEP frame is incorrect or not directed to our tag. */
                NRF_NFCT->TASKS_ENABLERXDATA = 1;
            }

            if (m_nfc_lib_callback != NULL)
            {
                /* This callback should trigger transmission of READ Response */
                m_nfc_lib_callback(m_nfc_lib_context,
                                   HAL_NFC_EVENT_DATA_RECEIVED,
                                   (void *)m_nfc_rx_buffer,
                                   rx_data_size);
            }

            /* Clear TXFRAMESTART EVENT so it can be checked in hal_nfc_send */
            nrf_nfct_event_clear(&NRF_NFCT->EVENTS_TXFRAMESTART);
        }

        NRF_LOG_DEBUG("Rx fend");
    }

    if (NRF_NFCT->EVENTS_TXFRAMEEND && (NRF_NFCT->INTEN & NFCT_INTEN_TXFRAMEEND_Msk))
    {
        nrf_nfct_event_clear(&NRF_NFCT->EVENTS_TXFRAMEEND);

        /* Disable TX END event to ignore frame transmission other than READ response */
        NRF_NFCT->INTENCLR = (NFCT_INTENCLR_TXFRAMEEND_Clear << NFCT_INTENCLR_TXFRAMEEND_Pos);

        if (m_deselect)
        {
            /* Re-enable Auto Collision Resolution */
#if defined(NRF52832_XXAA) || defined(NRF52832_XXAB)
            (*(uint32_t volatile *)(0x4000559C)) &= ~(1u);
#else
            NRF_NFCT->AUTOCOLRESCONFIG &= ~NFCT_AUTOCOLRESCONFIG_MODE_Msk;
#endif //defined(NRF52832_XXAA) || defined(NRF52832_XXAB)
            NRF_NFCT->TASKS_GOSLEEP   = 1;
            /* Disable RX here (will be enabled at SELECTED) */
            NRF_NFCT->INTENCLR        = NFCT_INTENCLR_RXFRAMEEND_Clear <<
                                        NFCT_INTENCLR_RXFRAMEEND_Pos;
            m_deselect   = false;
            m_t4t_active = false;
        }
        else
        {
            /* Set up for reception */
            NRF_NFCT->PACKETPTR          = (uint32_t) m_nfc_rx_buffer;
            NRF_NFCT->MAXLEN             = NFC_RX_BUFFER_SIZE;
            NRF_NFCT->TASKS_ENABLERXDATA = 1;
            NRF_NFCT->INTENSET           =
                        (NFCT_INTENSET_RXFRAMEEND_Enabled << NFCT_INTENSET_RXFRAMEEND_Pos) |
                        (NFCT_INTENSET_RXERROR_Enabled    << NFCT_INTENSET_RXERROR_Pos);
        }

        if (m_nfc_lib_callback != NULL)
        {
            m_nfc_lib_callback(m_nfc_lib_context, HAL_NFC_EVENT_DATA_TRANSMITTED, 0, 0);
        }

        NRF_LOG_DEBUG("Tx fend");
    }

    if (NRF_NFCT->EVENTS_SELECTED && (NRF_NFCT->INTEN & NFCT_INTEN_SELECTED_Msk))
    {
        nrf_nfct_event_clear(&NRF_NFCT->EVENTS_SELECTED);

